app/controllers/bikes_controller.rb

  def index
    # Rails.logger.debug "==== indexアクション呼ばれたよ！ ===="
    @bikes = Bike.includes(:user).with_attached_image
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 7]]
SELECT "bikes".* FROM "bikes" WHERE "bikes"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

  def destroy
    @bike = current_user.bike
    @bike.destroy
---
DELETE FROM "bikes" WHERE "bikes"."id" = $1  [["id", 4]]

  def create
    @bike = current_user.build_bike(bike_params)
    if @bike.save
---
INSERT INTO "bikes" ("image", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", nil], ["description", "私のこだわりはこのカラーです！オールドスタイルがしぶい！！"], ["user_id", 7], ["created_at", "2025-03-31 23:50:40.914618"], ["updated_at", "2025-03-31 23:50:40.914618"]]
UPDATE "bikes" SET "updated_at" = $1 WHERE "bikes"."id" = $2  [["updated_at", "2025-03-31 23:50:40.941444"], ["id", 4]]

  def update
    @bike = current_user.bike
    if @bike.update(bike_params)
---
UPDATE "bikes" SET "updated_at" = $1 WHERE "bikes"."id" = $2  [["updated_at", "2025-03-31 23:46:50.285364"], ["id", 3]]