app/controllers/comments_controller.rb

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "route_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "海の上走っとるやんけ〜\n"], ["user_id", 2], ["route_id", 14], ["created_at", "2025-03-20 23:54:50.246286"], ["updated_at", "2025-03-20 23:54:50.246286"]]
---
  def create
    @route = Route.find(params[:route_id])
    @comment = @route.comments.build(comment_params)
    # Devise等で current_user が使える場合は下記のようにセット
    @comment.user_id = current_user.id if defined?(current_user)

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
  def destroy
    @comment = Comment.find(params[:id])
    # 本人かどうかのチェック（オプション）
    if @comment.user_id == current_user.id
      @comment.destroy