app/controllers/favorites_controller.rb

  def create
    route = Route.find(params[:route_id])
    favorite = current_user.favorites.build(route: route)

    if favorite.save
---
SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "route_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["route_id", 12], ["created_at", "2025-03-15 00:56:26.150885"], ["updated_at", "2025-03-15 00:56:26.150885"]]