app/controllers/routes_controller.rb

  def create
    @route = current_user.routes.build(route_params)

    if params[:route][:waypoints].present?
      begin
        parsed = JSON.parse(params[:route][:waypoints])
        @route.waypoints = parsed.is_a?(Array) ? parsed : []
      rescue JSON::ParserError
        @route.waypoints = []
      end
    else
      @route.waypoints = []
    end

    if @route.save
---
INSERT INTO "routes" ("title", "description", "distance", "start_location", "end_location", "user_id", "created_at", "updated_at", "latitude", "longitude", "start_lat", "start_lng", "end_lat", "end_lng", "favorites_count", "waypoints") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def destroy
    @route = Route.find(params[:id])
    @route.destroy
---
DELETE FROM "routes" WHERE "routes"."id" = $1  [["id", 61]]

  def authorize_user
    route = Route.find(params[:id])
---
SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 96], ["LIMIT", 1]]