app/controllers/routes_controller.rb

SELECT "routes".* FROM "routes"
---
  def index
    @routes = Route.all

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def show
    @route = Route.find(params[:id])

INSERT INTO "routes" ("title", "description", "distance", "start_location", "end_location", "user_id", "created_at", "updated_at", "latitude", "longitude", "start_lat", "start_lng", "end_lat", "end_lng", "favorites_count", "waypoints") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    @route = current_user.routes.build(route_params)
    if @route.save

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def edit
    @route = Route.find(params[:id])

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "routes" SET "updated_at" = $1, "latitude" = $2, "longitude" = $3, "start_lat" = $4, "start_lng" = $5, "end_lat" = $6, "end_lng" = $7 WHERE "routes"."id" = $8  [["updated_at", "2025-04-02 02:19:11.625677"], ["latitude", 33.0], ["longitude", 133.0], ["start_lat", 33.0], ["start_lng", 133.0], ["end_lat", 33.3], ["end_lng", 133.33], ["id", 21]]
---
  def update
    @route = Route.find(params[:id])
    if @route.update(route_params)

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "routes" WHERE "routes"."id" = $1  [["id", 16]]
---
  def destroy
    @route = Route.find(params[:id])
    @route.destroy

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def authorize_user
    route = Route.find(params[:id])