app/controllers/runs_controller.rb

  def create
    @route = Route.find(params[:route_id])
    Run.create!(user_id: current_user.id, route_id: @route.id)
---
SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
INSERT INTO "runs" ("user_id", "ran_at", "created_at", "updated_at", "route_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["ran_at", nil], ["created_at", "2025-03-25 22:55:10.785773"], ["updated_at", "2025-03-25 22:55:10.785773"], ["route_id", 19]]