app/views/routes/show.html.erb

SELECT COUNT(*) FROM "runs" WHERE "runs"."route_id" = $1  [["route_id", 12]]
---

<%= @route.runs.count%>人が実際に走りました！

SELECT "comments".* FROM "comments" WHERE "comments"."route_id" = $1  [["route_id", 18]]
---
<h2>コメント一覧</h2>
<% @route.comments.each do |comment| %>