app/views/routes/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."route_id" = $1  [["route_id", 20]]
---
      <p><strong>終了地点:</strong> <%= @route.end_location %></p>
      <p><strong>お気に入り数:</strong> <%= @route.favorites.count %></p>

SELECT COUNT(*) FROM "runs" WHERE "runs"."route_id" = $1  [["route_id", 20]]
---
      <% end %>
      <%= @route.runs.count%>人が実際に走りました！

SELECT "comments".* FROM "comments" WHERE "comments"."route_id" = $1  [["route_id", 20]]
---
      <h2>コメント一覧</h2>
      <% @route.comments.each do |comment| %>