app/views/routes/show.html.erb

      <h2>コメント一覧</h2>
      <% @route.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."route_id" = $1  [["route_id", 93]]